In [26]:
square = lambda x: x**3
print(square(5))

125

In [27]:
numbers = [2, 3, 4, 5, 6]
squares = map(lambda x: x**3, numbers)
print(list(squares))  # [1, 4, 9, 16, 25]

[8, 27, 64, 125, 216]

In [28]:
cat = 'cat'
dog = 'dog'
cow = 'cow'
lion = 'lion'
animal = dog
ret=  cow if animal is cat else lion if animal is dog else lion
print(ret)

lion

In [29]:
ret= dog if animal is dog else cot if animal is cat else cat
print(ret)

dog

In [30]:
cat = 'cat'
dog = 'dog'
cow = 'cow'
lion = 'lion'
animal  = cow
ret = None
if animal is cat:
    ret = cat
elif animal is dog:
    ret = dog
elif animal is cow :
    ret = cow
else :
    ret = lion
print(ret)

cow

In [31]:
arr = ["a","b","c"]
def solution(arr):
    return ''.join(arr)
solution(arr)

'abc'

In [32]:
def solution(num_list, n):
    answer = []
    for i in range(num_list):
        if n<= 6 :
            return answer
        else :
            pass
    for j in range(num_list):
        return num_list[n:]
solution()

TypeError: solution() missing 2 required positional arguments: 'num_list' and 'n'

In [ ]:
import pandas as pd
import numpy as np
frame = pd.DataFrame([[np.nan, np.nan, np.nan, np.nan],
                     [1,2,3,4],
                     [5,6,7,8],
                     [9,10,11,np.nan]],
                     index=['가a','나b','다c','라d'],
                     columns=['a가','b나','c다','d라'],)
frame

     a가    b나    c다   d라
가a  NaN   NaN   NaN  NaN
나b  1.0   2.0   3.0  4.0
다c  5.0   6.0   7.0  8.0
라d  9.0  10.0  11.0  NaN

In [ ]:
frame.dropna()

     a가   b나   c다   d라
나b  1.0  2.0  3.0  4.0
다c  5.0  6.0  7.0  8.0

In [ ]:
frame.dropna(how='all')

     a가    b나    c다   d라
나b  1.0   2.0   3.0  4.0
다c  5.0   6.0   7.0  8.0
라d  9.0  10.0  11.0  NaN

In [ ]:
frame.fillna(100)

       a가     b나     c다     d라
가a  100.0  100.0  100.0  100.0
나b    1.0    2.0    3.0    4.0
다c    5.0    6.0    7.0    8.0
라d    9.0   10.0   11.0  100.0

In [ ]:
frame.fillna({'a가':10, 'c다':3})
# 딕셔너리로 해당 값 입력

      a가    b나    c다   d라
가a  10.0   NaN   3.0  NaN
나b   1.0   2.0   3.0  4.0
다c   5.0   6.0   7.0  8.0
라d   9.0  10.0  11.0  NaN

In [ ]:
frame.isna().sum()

a가    1
b나    1
c다    1
d라    2
dtype: int64

In [ ]:
data = pd.DataFrame({'id':['0001', '0002', '0003', '0001'],
                     'name':['a','b','c','a']})

- 중복 제거
- duplicated() : 각 row가 중복인지(True) 아닌지(False) 알려주는 불리언

In [ ]:
data.duplicated() # 중복 체크, True 중복O

0    False
1    False
2    False
3     True
dtype: bool

In [ ]:
data.drop_duplicates() # 중복 삭제

     id name
0  0001    a
1  0002    b
2  0003    c

- cut 함수

In [ ]:
ages = [20,30,67,39,59,44,56,77,28,80,32,46,52,19,33,5,15,50,29,21,33,48,85,80,31,10]
bins = [0,20,40,60,100]

In [ ]:
cuts = pd.cut(ages, bins) # 범주화/ 묶기/ 카테고리 // 구간 자름
# bins가 구간 0~20, …, 60~100으로 카테고리를 나누고, 해당 범주에 맞는 요소가 많은 것 부터 차례로 나열
cuts

[(0, 20], (20, 40], (60, 100], (20, 40], (40, 60], ..., (40, 60], (60, 100], (60, 100], (20, 40], (0, 20]]
Length: 26
Categories (4, interval[int64, right]): [(0, 20] < (20, 40] < (40, 60] < (60, 100]]

In [ ]:
cuts.categories # cut 메소드의 결과는 categorical이라는 특수 객체에 존재. 구간을 나눠줌

IntervalIndex([(0, 20], (20, 40], (40, 60], (60, 100]], dtype='interval[int64, right]')

In [ ]:
cuts.codes # 각 요소의 구간인덱스를 알려줌
# 해당 요소의 카테고리 인덱스를 반환

array([0, 1, 3, 1, 2, 2, 2, 3, 1, 3, 1, 2, 2, 0, 1, 0, 0, 2, 1, 1, 1, 2,
       3, 3, 1, 0], dtype=int8)

In [35]:
group_names = ["10대이하", "20~30대", "40~50대", "60대 이상"]
pd.cut(ages, bins, labels=group_names)
# ages 리스트를 bins로 나누어 4개의 구간으로 나눈 후, 
# group_names 리스트를 label로 갖는 각 구간에 대한 label이 지정된 결과를 반환

['10대이하', '20~30대', '60대 이상', '20~30대', '40~50대', ..., '40~50대', '60대 이상', '60대 이상', '20~30대', '10대이하']
Length: 26
Categories (4, object): ['10대이하' < '20~30대' < '40~50대' < '60대 이상']

In [44]:
pd.cut(ages,4,precision=1).value_counts() # 구간을 균등한 길이로 나눔. 구간 값이 균등
# precision : 소수점 자릿수, 3이면 소수점 세번째에서 반올림
# 객체에 대해 value_counts() 각 구간에 속하는 데이터의 갯수를 세어준 결과를 출력

(4.9, 25.0]     6
(25.0, 45.0]    9
(45.0, 65.0]    6
(65.0, 85.0]    5
Name: count, dtype: int64

In [50]:
pd.qcut(ages,4).value_counts()
# qcut 구간을 균등하게 나눔, 분포인원 균등
# 4개의 동일한 구간으로 분할하고, 각 구간에 속한 데이터 포인트의 개수를 세어 출력

(4.999, 28.25]    7
(28.25, 36.0]     6
(36.0, 55.0]      6
(55.0, 85.0]      7
Name: count, dtype: int64

- get_dummines
- 명목형 변수를(수치형X) 문자형 원핫(OneHot) 인코딩 해줌.
  - pd.get_dummies(df) 함수는 데이터프레임 내의 범주형 변수를  
  더미 변수(dummy variable)로 변환해주는 함수  
  (수치형 변수는 숫자로 이루어진 변수,  
  범주형 변수는 문자열, 정수, 카테고리 등으로 이루어진 변수들)

  - 수치형 변수는 숫자로 이루어진 변수를 말하며, 연속형 변수와 이산형 변수로 나뉩니다.  
    1. 연속형 변수: 정해진 범위 안에서 모든 값을 가질 수 있는 변수
    2. 이산형 변수: 정수와 같이 연속적이지 않은 값을 가지는 변수  

  - 범주형 변수는 명목형 변수와 순서형 변수로 나뉩니다.  
    1. 명목형 변수: 순서가 없는 카테고리형 변수(ex. 성별, 지역, 직업 등)
    
    2. 순서형 변수: 범주 간에 순서가 있는 변수(ex. 학점 등급, 만족도 등)

정수로 이루어져 있어도 변수의 의미에 따라서  
  수치형 변수일 수도, 범주형 변수일 수도 있음

사람의 성별을 나타내는 변수는 0과 1로 인코딩하더라도 범주형 변수입니다.  
반면에, 사람의 연령을 나타내는 변수는 정수 값으로  
인코딩하고 그 의미가 연속적인 값이라면 수치형 변수입니다.  
하지만 그 값이 나이의 범주를 나타내는 것이라면  
범주형 변수일 수도 있습니다.  
따라서 변수의 의미와 데이터 분석의 목적에 따라서 변수의 유형을 결정해야 함

In [53]:
df = pd.DataFrame({'col1':[10,20,30],  # column1
                   'col2':['a','b','c']}) #  column2
df # col1, col2 열이 있는 DataFrame 출력

   col1 col2
0    10    a
1    20    b
2    30    c

In [55]:
pd.get_dummies(df)
# 범주형 변수가 존재하는 열들을 더미 변수로 변환하고,
# 해당 더미 변수를 새로운 열로 추가
# 범주형 변수가 아닌 수치형 변수는 그대로 유지

   col1  col2_a  col2_b  col2_c
0    10    True   False   False
1    20   False    True   False
2    30   False   False    True

In [75]:
df = pd.DataFrame({'col1':['001','002','003','004','005','006'],
                   'col2':[10,20,30,40,50,60],
                   'col3':['서울시','경기도','서울시','제주도','경기도','서울시']})
df
# arr_col2 = df['col2'].to_numpy().reshape(-1, 2)  
# reshape는 numpy 함수로 사용하려면 위 코드를 작성하여
# pd.DataFrame을 numpy로 바꿔서 사용

  col1  col2 col3
0  001    10  서울시
1  002    20  경기도
2  003    30  서울시
3  004    40  제주도
4  005    50  경기도
5  006    60  서울시

In [76]:
pd.get_dummies(df) # 1:True, 0:False 유효하지 않은 분석
# 원핫(onehot)쓰면 스팔스 매트릭스(sparse matrix)대부분의 요소가 0인 행렬 자주,많이 발생

,col2,col1_001,col1_002,col1_003,col1_004,col1_005,col1_006,col3_경기도,col3_서울시,col3_제주도
0,10,True,False,False,False,False,False,False,True,False
1,20,False,True,False,False,False,False,True,False,False
2,30,False,False,True,False,False,False,False,True,False
3,40,False,False,False,True,False,False,False,False,True
4,50,False,False,False,False,True,False,True,False,False
5,60,False,False,False,False,False,True,False,True,False

In [78]:
import pandas as pd

kbo = pd.read_csv('C:/Users/5/kbo.csv') # file load 
kbo

      연도  순위    팀  경기수   승   패  무     승률   게임차
0   2019   1   두산  144  88  55  1  0.615   0.0
1   2019   2   키움  144  86  57  1  0.601   2.0
2   2019   3   SK  144  88  55  1  0.615   0.0
3   2019   4   LG  144  79  64  1  0.552   9.0
4   2019   5   NC  144  73  69  2  0.514  14.5
5   2019   6   KT  144  71  71  2  0.500  16.5
6   2019   7  KIA  144  62  80  2  0.437  25.5
7   2019   8   삼성  144  60  83  1  0.420  28.0
8   2019   9   한화  144  58  86  0  0.403  30.5
9   2019  10   롯데  144  48  93  3  0.340  39.0
10  2018   1   두산  144  93  51  0  0.646 -14.5
11  2018   2   SK  144  78  65  1  0.545   0.0
12  2018   3   한화  144  77  67  0  0.535   1.5
13  2018   4   넥센  144  75  69  0  0.521   3.5
14  2018   5  KIA  144  70  74  0  0.486   8.5
15  2018   5   삼성  144  68  72  4  0.486   8.5
16  2018   7   롯데  144  68  74  2  0.479   9.5
17  2018   8   LG  144  68  75  1  0.476  10.0
18  2018   9   KT  144  59  82  3  0.418  18.0
19  2018  10   NC  144  58  85  1  0.406  20.0
20  2017   1  KIA  144  87  56  1  0.608   0.0
21  2017   2   두산  144  84  57  3  0.596   2.0
22  2017   3   롯데  144  80  62  2  0.563   6.5
23  2017   4   NC  144  79  62  3  0.560   7.0
24  2017   5   SK  144  75  68  1  0.524  12.0
25  2017   6   LG  144  69  72  3  0.489  17.0
26  2017   7   넥센  144  69  73  2  0.486  17.5
27  2017   8   한화  144  61  81  2  0.430  25.5
28  2017   9   삼성  144  55  84  5  0.396  30.0
29  2017  10   KT  144  50  94  0  0.347  37.5

In [79]:
kbo.shape # 30열 9행, (열과 행의 갯수를 알려줌)

(30, 9)

In [80]:
kbo.columns # 칼럼즈 columns 열들 title(?)을 알려줌

Index(['연도', '순위', '팀', '경기수', '승', '패', '무', '승률', '게임차'], dtype='object')

In [81]:
kbo['팀'].unique # '팀' 열의 중복 이름을 가진 팀 제거

<bound method Series.unique of 0      두산
1      키움
2      SK
3      LG
4      NC
5      KT
6     KIA
7      삼성
8      한화
9      롯데
10     두산
11     SK
12     한화
13     넥센
14    KIA
15     삼성
16     롯데
17     LG
18     KT
19     NC
20    KIA
21     두산
22     롯데
23     NC
24     SK
25     LG
26     넥센
27     한화
28     삼성
29     KT
Name: 팀, dtype: object>

In [82]:
kbo.info() # csv 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연도      30 non-null     int64
 1   순위      30 non-null     int64
 2   팀       30 non-null     object
 3   경기수     30 non-null     int64
 4   승       30 non-null     int64
 5   패       30 non-null     int64
 6   무       30 non-null     int64
 7   승률      30 non-null     float64
 8   게임차     30 non-null     float64
dtypes: float64(2), int64(6), object(1)
memory usage: 2.2+ KB

In [83]:
kbo.describe() # 디스크라이브, 각 수치 count …mean … 50% … max

,연도,순위,경기수,승,패,무,승률,게임차
count,30.000000,30.000000,30.0,30.000000,30.000000,30.000000,30.000000,30.000000
mean,2018.000000,5.466667,144.0,71.200000,71.200000,1.600000,0.499800,12.833333
std,0.830455,2.921187,0.0,11.871147,11.591912,1.275769,0.082079,12.576204
min,2017.000000,1.000000,144.0,48.000000,51.000000,0.000000,0.340000,-14.500000
25%,2017.000000,3.000000,144.0,61.250000,62.500000,1.000000,0.431750,2.375000
50%,2018.000000,5.000000,144.0,70.500000,71.500000,1.000000,0.494500,9.750000
75%,2019.000000,8.000000,144.0,79.000000,80.750000,2.000000,0.558000,19.500000
max,2019.000000,10.000000,144.0,93.000000,94.000000,5.000000,0.646000,39.000000

In [84]:
kbo.isna().sum() # 결측치(NaN, None) 확인 및 나열

연도     0
순위     0
팀      0
경기수    0
승      0
패      0
무      0
승률     0
게임차    0
dtype: int64

- groupby를 하면 group으로 묶인 Groupby 객체를 반환
    - 이 객체는 그룹 연산을 위해 필요한 모든 정보를 가지고 있음.
    - 새로운 정보를 추출 할 수 있음

In [86]:
kbo.groupby('팀') # 팀' 기준으로 그룹핑
#  '팀'을 가진 데이터끼리 묶어서 다양한 집계 함수들을 적용 가능

In [88]:
kbo.groupby('팀').count() # 총 수를 카운트, 넥센->키움, 팀 이름 바뀜
# 팀별로 몇 개의 데이터가 있는지를 확인, dataframe의 각 열마다
# 값이 있는 데이터의 개수를 세는 것이기 때문에 결과 값은 모두 같음

     연도  순위  경기수  승  패  무  승률  게임차
팀
KIA   3   3    3  3  3  3   3    3
KT    3   3    3  3  3  3   3    3
LG    3   3    3  3  3  3   3    3
NC    3   3    3  3  3  3   3    3
SK    3   3    3  3  3  3   3    3
넥센    2   2    2  2  2  2   2    2
두산    3   3    3  3  3  3   3    3
롯데    3   3    3  3  3  3   3    3
삼성    3   3    3  3  3  3   3    3
키움    1   1    1  1  1  1   1    1
한화    3   3    3  3  3  3   3    3